Revit 2027 API
Surface.IsCoincidentWith Method
 Determine if two surfaces are coincident (ignoring Envelopes). For an affirmative answer, the surfaces must have the same type (e.g., two planes).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCoincidentWith(
	Surface other
)
Public Function IsCoincidentWith (
	other As Surface
) As Boolean
public:
bool IsCoincidentWith(
	Surface^ other
)
member IsCoincidentWith :
        other : Surface -> bool
Parameters
other Surface
 The surfaces which this should be compared with
Return Value
Boolean
 True if surfaces are coincident, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Surface Class
Autodesk.Revit.DB Namespace